OsmoHNBGW> enable
OsmoHNBGW# list
...
  (msc|sgsn) <0-1000> ranap reset
...
OsmoHNBGW# msc?
  msc  Manipulate an IuCS link to an MSC
OsmoHNBGW# msc ?
  <0-1000>  MSC/SGSN nr
OsmoHNBGW# msc 0 ?
  ranap  Manipulate RANAP layer of Iu-interface
OsmoHNBGW# msc 0 ranap ?
  reset  Flip this CN link to disconnected state and re-send RANAP RESET

OsmoHNBGW# sgsn?
  sgsn  Manipulate an IuPS link to an SGSN
OsmoHNBGW# sgsn ?
  <0-1000>  MSC/SGSN nr
OsmoHNBGW# sgsn 0 ?
  ranap  Manipulate RANAP layer of Iu-interface
OsmoHNBGW# sgsn 0 ranap ?
  reset  Flip this CN link to disconnected state and re-send RANAP RESET

OsmoHNBGW# configure terminal

OsmoHNBGW(config)# ### cnpool doc strings
OsmoHNBGW(config)# list
...
  apply sccp
...

OsmoHNBGW(config)# apply?
  apply  Immediately use configuration modified via telnet VTY, and restart components as needed.

OsmoHNBGW(config)# apply ?
  sccp  For telnet VTY: apply all SCCP and NRI config changes made to any CN pools and CN links in the running osmo-hnbgw process. If 'remote-addr' changed, related SCCP links will be restarted, possibly dropping active UE contexts. This is run implicitly on program startup, only useful to apply changes made later via telnet VTY.

OsmoHNBGW(config)# hnbgw
OsmoHNBGW(config-hnbgw)# list
...
  iucs
  iups
...
OsmoHNBGW(config-hnbgw)# iucs?
  iucs  Configure IuCS options
OsmoHNBGW(config-hnbgw)# iups?
  iups  Configure IuPS options

OsmoHNBGW(config-hnbgw)# iucs

OsmoHNBGW(config-hnbgw-iucs)# list
...
  nri bitlen <1-15>
  nri null add <0-32767> [<0-32767>]
  nri null del <0-32767> [<0-32767>]
...

OsmoHNBGW(config-hnbgw-iucs)# nri?
  nri  Mapping of Network Resource Indicators to this CN peer, for CN pooling

OsmoHNBGW(config-hnbgw-iucs)# nri ?
  bitlen  Set number of bits that an NRI has, to extract from TMSI identities (always starting just after the TMSI's most significant octet).
  null    Define NULL-NRI values that cause re-assignment of an MS to a different CN peer, for CN pooling.

OsmoHNBGW(config-hnbgw-iucs)# nri bitlen ?
  <1-15>  bit count (default: 10)

OsmoHNBGW(config-hnbgw-iucs)# nri null ?
  add  Add NULL-NRI value (or range)
  del  Remove NRI value or range from the NRI mapping for this CN link

OsmoHNBGW(config-hnbgw-iucs)# nri null add ?
  <0-32767>  First value of the NRI value range, should not surpass the configured 'nri bitlen'.

OsmoHNBGW(config-hnbgw-iucs)# nri null add 0 ?
  [<0-32767>]  Last value of the NRI value range, should not surpass the configured 'nri bitlen' and be larger than the first value; if omitted, apply only the first value.

OsmoHNBGW(config-hnbgw-iucs)# nri null del ?
  <0-32767>  First value of the NRI value range, should not surpass the configured 'nri bitlen'.

OsmoHNBGW(config-hnbgw-iucs)# nri null del 0 ?
  [<0-32767>]  Last value of the NRI value range, should not surpass the configured 'nri bitlen' and be larger than the first value; if omitted, apply only the first value.

OsmoHNBGW(config-hnbgw-iucs)# exit

OsmoHNBGW(config-hnbgw)# iups

OsmoHNBGW(config-hnbgw-iups)# list
...
  nri bitlen <1-15>
  nri null add <0-32767> [<0-32767>]
  nri null del <0-32767> [<0-32767>]
...

OsmoHNBGW(config-hnbgw-iups)# nri?
  nri  Mapping of Network Resource Indicators to this CN peer, for CN pooling

OsmoHNBGW(config-hnbgw-iups)# nri ?
  bitlen  Set number of bits that an NRI has, to extract from TMSI identities (always starting just after the TMSI's most significant octet).
  null    Define NULL-NRI values that cause re-assignment of an MS to a different CN peer, for CN pooling.

OsmoHNBGW(config-hnbgw-iups)# nri bitlen ?
  <1-15>  bit count (default: 10)

OsmoHNBGW(config-hnbgw-iups)# nri null ?
  add  Add NULL-NRI value (or range)
  del  Remove NRI value or range from the NRI mapping for this CN link

OsmoHNBGW(config-hnbgw-iups)# nri null add ?
  <0-32767>  First value of the NRI value range, should not surpass the configured 'nri bitlen'.

OsmoHNBGW(config-hnbgw-iups)# nri null add 0 ?
  [<0-32767>]  Last value of the NRI value range, should not surpass the configured 'nri bitlen' and be larger than the first value; if omitted, apply only the first value.

OsmoHNBGW(config-hnbgw-iups)# nri null del ?
  <0-32767>  First value of the NRI value range, should not surpass the configured 'nri bitlen'.

OsmoHNBGW(config-hnbgw-iups)# nri null del 0 ?
  [<0-32767>]  Last value of the NRI value range, should not surpass the configured 'nri bitlen' and be larger than the first value; if omitted, apply only the first value.

OsmoHNBGW(config-hnbgw-iups)# exit
OsmoHNBGW(config-hnbgw)# exit

OsmoHNBGW(config)# msc?
  msc  Configure an IuCS link to an MSC
OsmoHNBGW(config)# msc ?
  <0-1000>  MSC nr

OsmoHNBGW(config)# sgsn?
  sgsn  Configure an IuPS link to an SGSN
OsmoHNBGW(config)# sgsn ?
  <0-1000>  SGSN nr

OsmoHNBGW(config)# ### The config file has no 'msc' or 'sgsn', so defaults have been set up
OsmoHNBGW(config)# show running-config
...
cs7 instance 0
...
 point-code 0.23.5
...
 sccp-address addr-dyn-msc-default
  routing-indicator PC
  point-code 0.23.1
  subsystem-number 142
 sccp-address addr-dyn-sgsn-default
  routing-indicator PC
  point-code 0.23.4
...
msc 0
 name msc-0
 remote-addr addr-dyn-msc-default
sgsn 0
 name sgsn-0
 remote-addr addr-dyn-sgsn-default
...

OsmoHNBGW(config)# msc 1

OsmoHNBGW(config-msc)# list
...
  remote-addr NAME
  nri add <0-32767> [<0-32767>]
  nri del <0-32767> [<0-32767>]
  show nri
  apply sccp
  allow-attach
  no allow-attach
  allow-emergency
  no allow-emergency
...

OsmoHNBGW(config-msc)# remote-addr?
  remote-addr  SCCP address to send RANAP/SCCP to
OsmoHNBGW(config-msc)# remote-addr ?
  NAME  SCCP address book entry name (see 'cs7 instance' / 'sccp-address')

OsmoHNBGW(config-msc)# show nri?
  nri  Mapping of Network Resource Indicators to this CN peer, for CN pooling

OsmoHNBGW(config-msc)# apply?
  apply  Immediately use configuration modified via telnet VTY, and restart components as needed.

OsmoHNBGW(config-msc)# apply ?
  sccp  For telnet VTY: apply SCCP and NRI config changes made to this CN link in the running osmo-hnbgw process. If 'remote-addr' changed, related SCCP links will be restarted, possibly dropping active UE contexts. This is run implicitly on program startup, only useful to apply changes made later via telnet VTY.

OsmoHNBGW(config-msc)# allow-attach?
  allow-attach  Allow this CN link to attach new subscribers (default).

OsmoHNBGW(config-msc)# allow-emergency?
  allow-emergency  Allow CM ServiceRequests with type emergency on this CN link

OsmoHNBGW(config-msc)# no ?
  allow-attach     Do not assign new subscribers to this CN link. Useful if an CN link in an CN link pool is configured to off-load subscribers. The CN link will still be operational for already IMSI-Attached subscribers, but the NAS node selection function will skip this CN link for new subscribers
  allow-emergency  Do not serve CM ServiceRequests with type emergency on this CN link

OsmoHNBGW(config-msc)# exit

OsmoHNBGW(config)# sgsn 1

OsmoHNBGW(config-sgsn)# list
...
  remote-addr NAME
  nri add <0-32767> [<0-32767>]
  nri del <0-32767> [<0-32767>]
  show nri
  apply sccp
  allow-attach
  no allow-attach
  allow-emergency
  no allow-emergency
...

OsmoHNBGW(config-sgsn)# remote-addr?
  remote-addr  SCCP address to send RANAP/SCCP to
OsmoHNBGW(config-sgsn)# remote-addr ?
  NAME  SCCP address book entry name (see 'cs7 instance' / 'sccp-address')

OsmoHNBGW(config-sgsn)# show nri?
  nri  Mapping of Network Resource Indicators to this CN peer, for CN pooling

OsmoHNBGW(config-sgsn)# apply?
  apply  Immediately use configuration modified via telnet VTY, and restart components as needed.

OsmoHNBGW(config-sgsn)# apply ?
  sccp  For telnet VTY: apply SCCP and NRI config changes made to this CN link in the running osmo-hnbgw process. If 'remote-addr' changed, related SCCP links will be restarted, possibly dropping active UE contexts. This is run implicitly on program startup, only useful to apply changes made later via telnet VTY.

OsmoHNBGW(config-sgsn)# allow-attach?
  allow-attach  Allow this CN link to attach new subscribers (default).

OsmoHNBGW(config-sgsn)# allow-emergency?
  allow-emergency  Allow CM ServiceRequests with type emergency on this CN link

OsmoHNBGW(config-sgsn)# no ?
  allow-attach     Do not assign new subscribers to this CN link. Useful if an CN link in an CN link pool is configured to off-load subscribers. The CN link will still be operational for already IMSI-Attached subscribers, but the NAS node selection function will skip this CN link for new subscribers
  allow-emergency  Do not serve CM ServiceRequests with type emergency on this CN link

OsmoHNBGW(config-sgsn)# exit

OsmoHNBGW(config)# ### Just by entering the nodes above, 'msc 1' and 'sgsn 1' now exist
OsmoHNBGW(config)# show running-config
...
msc 0
 name msc-0
 remote-addr addr-dyn-msc-default
msc 1
 name msc-1
sgsn 0
 name sgsn-0
 remote-addr addr-dyn-sgsn-default
sgsn 1
 name sgsn-1
...

OsmoHNBGW(config)# ### Add {msc,sgsn}x{2,3}

OsmoHNBGW(config)# msc 2
OsmoHNBGW(config-msc)# remote-addr addr-msc2
OsmoHNBGW(config-msc)# no allow-attach
OsmoHNBGW(config-msc)# exit

OsmoHNBGW(config)# msc 3
OsmoHNBGW(config-msc)# remote-addr addr-msc3
OsmoHNBGW(config-msc)# allow-emergency
OsmoHNBGW(config-msc)# exit

OsmoHNBGW(config)# sgsn 2
OsmoHNBGW(config-sgsn)# remote-addr addr-sgsn2
OsmoHNBGW(config-sgsn)# exit

OsmoHNBGW(config)# sgsn 3
OsmoHNBGW(config-sgsn)# remote-addr addr-sgsn3
OsmoHNBGW(config-sgsn)# exit

OsmoHNBGW(config)# show running-config
...
msc 0
 name msc-0
 remote-addr addr-dyn-msc-default
msc 1
 name msc-1
msc 2
 name msc-2
 remote-addr addr-msc2
 no allow-attach
msc 3
 name msc-3
 remote-addr addr-msc3
 allow-emergency
sgsn 0
 name sgsn-0
 remote-addr addr-dyn-sgsn-default
sgsn 1
 name sgsn-1
sgsn 2
 name sgsn-2
 remote-addr addr-sgsn2
sgsn 3
 name sgsn-3
 remote-addr addr-sgsn3
...

OsmoHNBGW(config)# ### Re-entering existing nodes works (does not create new ones)
OsmoHNBGW(config)# msc 2
OsmoHNBGW(config-msc)# allow-attach
OsmoHNBGW(config-msc)# exit
OsmoHNBGW(config)# msc 3
OsmoHNBGW(config-msc)# remote-addr addr-msc4
OsmoHNBGW(config-msc)# no allow-emergency
OsmoHNBGW(config-msc)# exit
OsmoHNBGW(config)# sgsn 2
OsmoHNBGW(config-sgsn)# remote-addr addr-sgsn4
OsmoHNBGW(config-sgsn)# exit

OsmoHNBGW(config)# show running-config
...
msc 0
 name msc-0
 remote-addr addr-dyn-msc-default
msc 1
 name msc-1
msc 2
 name msc-2
 remote-addr addr-msc2
msc 3
 name msc-3
 remote-addr addr-msc4
sgsn 0
 name sgsn-0
 remote-addr addr-dyn-sgsn-default
sgsn 1
 name sgsn-1
sgsn 2
 name sgsn-2
 remote-addr addr-sgsn4
sgsn 3
 name sgsn-3
 remote-addr addr-sgsn3
...

OsmoHNBGW(config)# ### Legacy configuration {'iups','iucs'} / 'remote-addr' redirects to {'msc 0','sgsn 0'}:

OsmoHNBGW(config)# hnbgw
OsmoHNBGW(config-hnbgw)# iucs
OsmoHNBGW(config-hnbgw-iucs)# remote-addr?
% There is no matched command.
OsmoHNBGW(config-hnbgw-iucs)# remote-addr ?
% There is no matched command.
OsmoHNBGW(config-hnbgw-iucs)# remote-addr addr-msc0
% Deprecated: instead of hnbgw/iucs/remote-addr, use 'msc 0'/remote-addr
OsmoHNBGW(config-hnbgw-iucs)# exit

OsmoHNBGW(config-hnbgw)# iups
OsmoHNBGW(config-hnbgw-iups)# remote-addr?
% There is no matched command.
OsmoHNBGW(config-hnbgw-iups)# remote-addr ?
% There is no matched command.
OsmoHNBGW(config-hnbgw-iups)# remote-addr addr-sgsn0
% Deprecated: instead of hnbgw/iups/remote-addr, use 'sgsn 0'/remote-addr
OsmoHNBGW(config-hnbgw-iups)# exit

OsmoHNBGW(config-hnbgw)# show running-config
...
hnbgw
...
msc 0
 name msc-0
 remote-addr addr-msc0
msc 1
 name msc-1
msc 2
 name msc-2
 remote-addr addr-msc2
msc 3
 name msc-3
 remote-addr addr-msc4
sgsn 0
 name sgsn-0
 remote-addr addr-sgsn0
sgsn 1
 name sgsn-1
sgsn 2
 name sgsn-2
 remote-addr addr-sgsn4
sgsn 3
 name sgsn-3
 remote-addr addr-sgsn3
...


OsmoHNBGW(config-hnbgw)# ### placement of the new 'msc' and 'sgsn' nodes must be below 'pfcp' and 'mgw' nodes
OsmoHNBGW(config-hnbgw)# show running-config
...
hnbgw
... !msc
 iuh
... !msc
 mgw 0
...
msc 0
...

OsmoHNBGW(config-hnbgw)# exit
OsmoHNBGW(config)# ### Apply all SCCP changes:
OsmoHNBGW(config)# apply sccp
OsmoHNBGW(config)# show running-config
...
hnbgw
...
msc 0
 name msc-0
 remote-addr addr-msc0
msc 1
 name msc-1
 remote-addr addr-dyn-msc-default
msc 2
 name msc-2
 remote-addr addr-msc2
msc 3
 name msc-3
 remote-addr addr-msc4
sgsn 0
 name sgsn-0
 remote-addr addr-sgsn0
sgsn 1
 name sgsn-1
 remote-addr addr-dyn-sgsn-default
sgsn 2
 name sgsn-2
 remote-addr addr-sgsn4
sgsn 3
 name sgsn-3
 remote-addr addr-sgsn3
...
