OsmoHNBGW> enable
OsmoHNBGW# configure terminal

OsmoHNBGW(config)# ### cnpool doc strings
OsmoHNBGW(config)# hnbgw
OsmoHNBGW(config-hnbgw)# list
...
  iucs
  iups
...
OsmoHNBGW(config-hnbgw)# iucs?
  iucs  Configure IuCS options
OsmoHNBGW(config-hnbgw)# iups?
  iups  Configure IuPS options

OsmoHNBGW(config-hnbgw)# exit

OsmoHNBGW(config)# msc?
  msc  Configure an IuCS link to an MSC
OsmoHNBGW(config)# msc ?
  <0-1000>  MSC nr

OsmoHNBGW(config)# sgsn?
  sgsn  Configure an IuPS link to an SGSN
OsmoHNBGW(config)# sgsn ?
  <0-1000>  SGSN nr

OsmoHNBGW(config)# ### The config file has no 'msc' or 'sgsn', so defaults have been set up
OsmoHNBGW(config)# show running-config
...
msc 0
sgsn 0
...

OsmoHNBGW(config)# msc 1

OsmoHNBGW(config-msc)# list
...
  remote-addr NAME
  apply sccp
...

OsmoHNBGW(config-msc)# remote-addr?
  remote-addr  SCCP address to send RANAP/SCCP to
OsmoHNBGW(config-msc)# remote-addr ?
  NAME  SCCP address book entry name (see 'cs7 instance' / 'sccp-address')

OsmoHNBGW(config-msc)# apply?
  apply  Immediately use configuration modified via telnet VTY, and restart components as needed.
OsmoHNBGW(config-msc)# apply ?
  sccp  For telnet VTY: apply SCCP and NRI config changes made to this CN link in the running osmo-hnbgw process. If 'remote-addr' changed, related SCCP links will be restarted, possibly dropping active UE contexts. This is run implicitly on program startup, only useful to apply changes made later via telnet VTY.

OsmoHNBGW(config-msc)# exit

OsmoHNBGW(config)# sgsn 1

OsmoHNBGW(config-sgsn)# list
...
  remote-addr NAME
  apply sccp
...

OsmoHNBGW(config-sgsn)# remote-addr?
  remote-addr  SCCP address to send RANAP/SCCP to
OsmoHNBGW(config-sgsn)# remote-addr ?
  NAME  SCCP address book entry name (see 'cs7 instance' / 'sccp-address')

OsmoHNBGW(config-sgsn)# apply?
  apply  Immediately use configuration modified via telnet VTY, and restart components as needed.
OsmoHNBGW(config-sgsn)# apply ?
  sccp  For telnet VTY: apply SCCP and NRI config changes made to this CN link in the running osmo-hnbgw process. If 'remote-addr' changed, related SCCP links will be restarted, possibly dropping active UE contexts. This is run implicitly on program startup, only useful to apply changes made later via telnet VTY.

OsmoHNBGW(config-sgsn)# exit

OsmoHNBGW(config)# ### Just by entering the nodes above, 'msc 1' and 'sgsn 1' now exist
OsmoHNBGW(config)# show running-config
...
msc 0
msc 1
sgsn 0
sgsn 1
...

OsmoHNBGW(config)# ### Add {msc,sgsn}x{2,3}

OsmoHNBGW(config)# msc 2
OsmoHNBGW(config-msc)# remote-addr addr-msc2
OsmoHNBGW(config-msc)# exit

OsmoHNBGW(config)# msc 3
OsmoHNBGW(config-msc)# remote-addr addr-msc3
OsmoHNBGW(config-msc)# exit

OsmoHNBGW(config)# sgsn 2
OsmoHNBGW(config-sgsn)# remote-addr addr-sgsn2
OsmoHNBGW(config-sgsn)# exit

OsmoHNBGW(config)# sgsn 3
OsmoHNBGW(config-sgsn)# remote-addr addr-sgsn3
OsmoHNBGW(config-sgsn)# exit

OsmoHNBGW(config)# show running-config
...
msc 0
msc 1
msc 2
 remote-addr addr-msc2
msc 3
 remote-addr addr-msc3
sgsn 0
sgsn 1
sgsn 2
 remote-addr addr-sgsn2
sgsn 3
 remote-addr addr-sgsn3
...

OsmoHNBGW(config)# ### Re-entering existing nodes works (does not create new ones)
OsmoHNBGW(config)# msc 3
OsmoHNBGW(config-msc)# remote-addr addr-msc4
OsmoHNBGW(config-msc)# exit
OsmoHNBGW(config)# sgsn 2
OsmoHNBGW(config-sgsn)# remote-addr addr-sgsn4
OsmoHNBGW(config-sgsn)# exit

OsmoHNBGW(config)# show running-config
...
msc 0
msc 1
msc 2
 remote-addr addr-msc2
msc 3
 remote-addr addr-msc4
sgsn 0
sgsn 1
sgsn 2
 remote-addr addr-sgsn4
sgsn 3
 remote-addr addr-sgsn3
...

OsmoHNBGW(config)# ### Legacy configuration {'iups','iucs'} / 'remote-addr' redirects to {'msc 0','sgsn 0'}:

OsmoHNBGW(config)# hnbgw
OsmoHNBGW(config-hnbgw)# iucs
OsmoHNBGW(config-hnbgw-iucs)# remote-addr?
% There is no matched command.
OsmoHNBGW(config-hnbgw-iucs)# remote-addr ?
% There is no matched command.
OsmoHNBGW(config-hnbgw-iucs)# remote-addr addr-msc0
% Deprecated: instead of hnbgw/iucs/remote-addr, use 'msc 0'/remote-addr
OsmoHNBGW(config-hnbgw-iucs)# exit

OsmoHNBGW(config-hnbgw)# iups
OsmoHNBGW(config-hnbgw-iups)# remote-addr?
% There is no matched command.
OsmoHNBGW(config-hnbgw-iups)# remote-addr ?
% There is no matched command.
OsmoHNBGW(config-hnbgw-iups)# remote-addr addr-sgsn0
% Deprecated: instead of hnbgw/iups/remote-addr, use 'sgsn 0'/remote-addr
OsmoHNBGW(config-hnbgw-iups)# exit

OsmoHNBGW(config-hnbgw)# show running-config
...
hnbgw
...
msc 0
 remote-addr addr-msc0
msc 1
msc 2
 remote-addr addr-msc2
msc 3
 remote-addr addr-msc4
sgsn 0
 remote-addr addr-sgsn0
sgsn 1
sgsn 2
 remote-addr addr-sgsn4
sgsn 3
 remote-addr addr-sgsn3
...


OsmoHNBGW(config-hnbgw)# ### placement of the new 'msc' and 'sgsn' nodes must be below 'pfcp' and 'mgw' nodes
OsmoHNBGW(config-hnbgw)# show running-config
...
hnbgw
... !msc
 iuh
... !msc
 mgw 0
...
msc 0
...
